RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_flash.c
  if(status == FLASH_COMPLETE)
  { 
    FLASH->CTLR|= CR_PER_Set;
    FLASH->ADDR = Page_Address; 
    FLASH->CTLR|= CR_STRT_Set;
 
		status = FLASH_WaitForLastOperation(EraseTimeout);
    
    FLASH->CTLR &= CR_PER_Reset;
  }

  return status;
}


/********************************************************************************
 * Function Name  : FLASH_EraseAllPages
 * Description    : Erases all FLASH pages.
 * Input          : None
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_EraseAllPages(void)
{
  FLASH_Status status = FLASH_COMPLETE;

  status = FLASH_WaitForLastOperation(EraseTimeout);
  if(status == FLASH_COMPLETE)
  {
     FLASH->CTLR |= CR_MER_Set;
     FLASH->CTLR |= CR_STRT_Set;
    
    status = FLASH_WaitForLastOperation(EraseTimeout);

    FLASH->CTLR &= CR_MER_Reset;
  }

  return status;
}

/********************************************************************************
 * Function Name  : FLASH_EraseAllBank1Pages
 * Description    : Erases all Bank1 FLASH pages.
 * Input          : None
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_EraseAllBank1Pages(void)
{
  FLASH_Status status = FLASH_COMPLETE;
  status = FLASH_WaitForLastBank1Operation(EraseTimeout);
  
  if(status == FLASH_COMPLETE)
  {
     FLASH->CTLR |= CR_MER_Set;
     FLASH->CTLR |= CR_STRT_Set;

    status = FLASH_WaitForLastBank1Operation(EraseTimeout);
    
    FLASH->CTLR &= CR_MER_Reset;
  }    
  return status;
}

/********************************************************************************
 * Function Name  : FLASH_EraseOptionBytes
 * Description    : Erases the FLASH option bytes.
 * Input          : None
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_EraseOptionBytes(void)
{
  uint16_t rdptmp = RDP_Key;

  FLASH_Status status = FLASH_COMPLETE;
  if(FLASH_GetReadOutProtectionStatus() != RESET)
  {
    rdptmp = 0x00;  
  }
  status = FLASH_WaitForLastOperation(EraseTimeout);
  if(status == FLASH_COMPLETE)
  {
    FLASH->OBKEYR = FLASH_KEY1;
    FLASH->OBKEYR = FLASH_KEY2;
    
    FLASH->CTLR |= CR_OPTER_Set;
    FLASH->CTLR |= CR_STRT_Set;
    status = FLASH_WaitForLastOperation(EraseTimeout);
    
    if(status == FLASH_COMPLETE)
    {
      FLASH->CTLR &= CR_OPTER_Reset;
      FLASH->CTLR |= CR_OPTPG_Set;
      OB->RDPR = (uint16_t)rdptmp; 
      status = FLASH_WaitForLastOperation(ProgramTimeout);
 
      if(status != FLASH_TIMEOUT)
      {
        FLASH->CTLR &= CR_OPTPG_Reset;
      }
    }
    else
    {
      if (status != FLASH_TIMEOUT)
      {
        FLASH->CTLR &= CR_OPTPG_Reset;
      }
    }  
  }
  return status;
}

/********************************************************************************
 * Function Name  : FLASH_ProgramWord
 * Description    : Programs a word at a specified address.
 * Input          : Address: specifies the address to be programmed.
 *                  Data: specifies the data to be programmed.
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_ProgramWord(uint32_t Address, uint32_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;
  __IO uint32_t tmp = 0;

  status = FLASH_WaitForLastOperation(ProgramTimeout);
  
  if(status == FLASH_COMPLETE)
  {
    FLASH->CTLR |= CR_PG_Set;
  
    *(__IO uint16_t*)Address = (uint16_t)Data;
    status = FLASH_WaitForLastOperation(ProgramTimeout);
 
    if(status == FLASH_COMPLETE)
    {
      tmp = Address + 2;
      *(__IO uint16_t*) tmp = Data >> 16;
      status = FLASH_WaitForLastOperation(ProgramTimeout);
      FLASH->CTLR &= CR_PG_Reset;
    }
    else
    {
      FLASH->CTLR &= CR_PG_Reset;
    }
  }         
     return status;
}

/********************************************************************************
 * Function Name  : FLASH_ProgramHalfWord
 * Description    : Programs a half word at a specified address.
 * Input          : Address: specifies the address to be programmed.
 *                  Data: specifies the data to be programmed.
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_ProgramHalfWord(uint32_t Address, uint16_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;

  status = FLASH_WaitForLastOperation(ProgramTimeout);
  if(status == FLASH_COMPLETE)
  {
    FLASH->CTLR |= CR_PG_Set;
    *(__IO uint16_t*)Address = Data;
    status = FLASH_WaitForLastOperation(ProgramTimeout);
    FLASH->CTLR &= CR_PG_Reset;
  } 
  return status;
}

/********************************************************************************
 * Function Name  : FLASH_ProgramOptionByteData
 * Description    : Programs a half word at a specified Option Byte Data address.
 * Input          : Address: specifies the address to be programmed.
 *                  Data: specifies the data to be programmed.
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_ProgramOptionByteData(uint32_t Address, uint8_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;
  status = FLASH_WaitForLastOperation(ProgramTimeout);
  if(status == FLASH_COMPLETE)
  {
    FLASH->OBKEYR = FLASH_KEY1;
    FLASH->OBKEYR = FLASH_KEY2;
    FLASH->CTLR |= CR_OPTPG_Set; 
    *(__IO uint16_t*)Address = Data;
    status = FLASH_WaitForLastOperation(ProgramTimeout);
    if(status != FLASH_TIMEOUT)
    {
      FLASH->CTLR &= CR_OPTPG_Reset;
    }
  }
  return status;
}

/********************************************************************************
 * Function Name  : FLASH_EnableWriteProtection
 * Description    : Write protects the desired pages
 * Input          : FLASH_Pages: specifies the address of the pages to be write protected.
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                  FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_EnableWriteProtection(uint32_t FLASH_Pages)
{
  uint16_t WRP0_Data = 0xFFFF, WRP1_Data = 0xFFFF, WRP2_Data = 0xFFFF, WRP3_Data = 0xFFFF;
  
