RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_flash.c
}


/********************************************************************************
 * Function Name  : FLASH_GetFlagStatus
 * Description    : Checks whether the specified FLASH flag is set or not.
 * Input          : FLASH_FLAG: specifies the FLASH flag to check.
 *                    FLASH_FLAG_BSY: FLASH Busy flag  
 *                    FLASH_FLAG_PGERR: FLASH Program error flag   
 *                    FLASH_FLAG_WRPRTERR: FLASH Write protected error flag    
 *                    FLASH_FLAG_EOP: FLASH End of Operation flag 
 *                    FLASH_FLAG_OPTERR:  FLASH Option Byte error flag 
 * Return         : The new state of FLASH_FLAG (SET or RESET).
 *********************************************************************************/
FlagStatus FLASH_GetFlagStatus(uint32_t FLASH_FLAG)
{
  FlagStatus bitstatus = RESET;

  if(FLASH_FLAG == FLASH_FLAG_OPTERR) 
  {
    if((FLASH->OBR & FLASH_FLAG_OPTERR) != (uint32_t)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
   if((FLASH->STATR & FLASH_FLAG) != (uint32_t)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  return bitstatus;
}

/********************************************************************************
 * Function Name  : FLASH_ClearFlag
 * Description    : Clears the FLASH's pending flags.
 * Input          : FLASH_FLAG: specifies the FLASH flags to clear.
 *                    FLASH_FLAG_PGERR: FLASH Program error flag   
 *                    FLASH_FLAG_WRPRTERR: FLASH Write protected error flag   
 *                    FLASH_FLAG_EOP: FLASH End of Operation flag    
 * Return         : None
 *********************************************************************************/
void FLASH_ClearFlag(uint32_t FLASH_FLAG)
{

  FLASH->STATR = FLASH_FLAG;

}

/********************************************************************************
 * Function Name  : FLASH_GetStatus
 * Description    : Returns the FLASH Status.
 * Input          : None   
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                                FLASH_ERROR_WRP or FLASH_COMPLETE.
 *********************************************************************************/
FLASH_Status FLASH_GetStatus(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;
  
  if((FLASH->STATR & FLASH_FLAG_BSY) == FLASH_FLAG_BSY) 
  {
    flashstatus = FLASH_BUSY;
  }
  else 
  {  
    if((FLASH->STATR & FLASH_FLAG_PGERR) != 0)
    { 
      flashstatus = FLASH_ERROR_PG;
    }
    else 
    {
      if((FLASH->STATR & FLASH_FLAG_WRPRTERR) != 0 )
      {
        flashstatus = FLASH_ERROR_WRP;
      }
      else
      {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  return flashstatus;
}

/********************************************************************************
 * Function Name  : FLASH_GetBank1Status
 * Description    : Returns the FLASH Bank1 Status.
 * Input          : None   
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                                FLASH_ERROR_WRP or FLASH_COMPLETE.
 *********************************************************************************/
FLASH_Status FLASH_GetBank1Status(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;
  
  if((FLASH->STATR & FLASH_FLAG_BANK1_BSY) == FLASH_FLAG_BSY) 
  {
    flashstatus = FLASH_BUSY;
  }
  else 
  {  
    if((FLASH->STATR & FLASH_FLAG_BANK1_PGERR) != 0)
    { 
      flashstatus = FLASH_ERROR_PG;
    }
    else 
    {
      if((FLASH->STATR & FLASH_FLAG_BANK1_WRPRTERR) != 0 )
      {
        flashstatus = FLASH_ERROR_WRP;
      }
      else
      {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  return flashstatus;
}


/********************************************************************************
 * Function Name  : FLASH_WaitForLastOperation
 * Description    : Waits for a Flash operation to complete or a TIMEOUT to occur.
 * Input          : Timeout: FLASH programming Timeout   
 * Return         : FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
 *                                FLASH_ERROR_WRP or FLASH_COMPLETE.
 *********************************************************************************/
FLASH_Status FLASH_WaitForLastOperation(uint32_t Timeout)
{ 
  FLASH_Status status = FLASH_COMPLETE;
   
  status = FLASH_GetBank1Status();
  while((status == FLASH_BUSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  return status;
}


/********************************************************************************
 * Function Name  : FLASH_WaitForLastBank1Operation
 * Description    : Waits for a Flash operation on Bank1 to complete or a TIMEOUT to occur.
 * Input          : Timeout: FLASH programming Timeout   
 * Return         : FLASH Status: The returned value can be: FLASH_ERROR_PG,
 *                                FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
 *********************************************************************************/
FLASH_Status FLASH_WaitForLastBank1Operation(uint32_t Timeout)
{ 
  FLASH_Status status = FLASH_COMPLETE;
   
  status = FLASH_GetBank1Status();
  while((status == FLASH_FLAG_BANK1_BSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }
  return status;
}


